Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t
Struct for the RebarEndDetailModifier.

Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t.RebarStrip
The rebar strip.

Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t.RebarHookData
The rebar hook data.

Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t.RebarThreading
The rebar threading.

Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t.RebarLengthAdjustment
The rebar length adjustment.

Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t.RebarCranking
The rebar cranking.

Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t.EndType
The end type.

Tekla.Structures.ModelInternal.dotRebarEndDetailStrip_t.HookRotation
The hook rotation.